OpenDTEF-v1812/tutorials/combustion/XiDyMFoam/annularCombustorTurbine/system/createPatchDict.cyclic
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.
// - always: remove zero-sized (non-coupled) patches (that were not added)

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - always create both halves in one invocation with correct 'neighbourPatch'
//   setting.
// - optionally pointSync true to guarantee points to line up.

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - in polyMesh/boundary file:
//      - loosen matchTolerance of all cyclics to get case to load
//      - or change patch type from 'cyclic' to 'patch'
//        and regenerate cyclic as above

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;//true;

tol 1e-3;

// Patches to create.
patches
(
    {
        name cyclic0;

        patchInfo
        {
            type cyclicSlip;
            neighbourPatch cyclic1;

            transform rotational;
            rotationAxis   (1 0 0);
            rotationCentre (0 0 0);

            matchTolerance $tol;
        }

        constructFrom patches;

        patches (coupled0);
    }
    {
        name cyclic1;

        patchInfo
        {
            type cyclicSlip;
            neighbourPatch cyclic0;

            transform rotational;
            rotationAxis   (1 0 0);
            rotationCentre (0 0 0);

            matchTolerance $tol;
        }

        constructFrom patches;

        patches (coupled1);
    }
);

// ************************************************************************* //
